""" Задание 1. Со значениями по умолчанию
Пишем функцию, которая генерирует песню la-la-la. Функция принимает 3 аргумента:

1-е число – сколько строк будет в песне. По умолчанию 3
2-е число – сколько «la» будет в строке («la» в строке объединяются дефисом). По умолчанию 3
3-е число – если 0, то в конце песни (в конце последней строчки) стоит точка, если 1, то в конце стоит «!». По умолчанию 0
"""
def generates_song(number_rows = 3 , number_la = 1, i = 0):
    text = 'la-'
    song = ((text*number_la).rstrip('-') + '\n') * number_rows
    if i == 0:
        last_sym = '.'
    elif i == 1:
        last_sym = '!'
    song = song.rstrip() + last_sym
    return song

a = generates_song(5, 10, 1)
print(a)
